Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_+99 Reinforced Wooden Stick.tmx
Source language: en
Languages: es_419

source: wh-who are you?
es_419: ¿Q-Quién es usted?

source: hahahahahaha, four guardians! hahahahahaha!
es_419: ¡Ja, ja, ja, ja, ja, cuatro guardianes! ¡Ja, ja, ja, ja, ja!

source: supreme commander of the top five guild alliance hawkeye
es_419: Hawkeye, comandante supremo de la alianza de los cinco mejores gremios

source: ...I was already in my mid-40s.
es_419: … ya tenía más de cuarenta años.

source: wh-what are you doing?
es_419: ¿Q-qué está haciendo?

source: for the first time ever,
es_419: Por primera vez,

source: beep beep
es_419: BIP BIP

source: there weren’t any quests or raids, either. all we did was grind to level up.
es_419: No había misiones ni incursiones. Solo matábamos bichos para subir de nivel.

source: "roach mom"?
es_419: ¿”Mamá cucaracha”?

source: th-this is no time to be making jokes, sir!
es_419: ¡N-no es momento para bromas, señor!

source: not only did he kill the players,
es_419: Y no solo mató a jugadores,

source: I was too obsessed with getting revenge that I left without picking up my loot.
es_419: Estaba tan obsesionado con vengarme que me fui sin mis recompensas.

source: I’ll be back soon.
es_419: Volveré pronto.

source: next episode. character deletion
es_419: Próximo episodio: Personaje eliminado

source: ...or destroy the whole planet...
es_419: … o destruir el planeta entero…

source: ...it would be an economical loss for him.
es_419: … sería una pérdida de dinero para él.

source: I assume it was urus who guided you here?
es_419: ¿Supongo que fue Urus quien te guio?

source: even after so much time has passed...
es_419: Aunque ya pasó mucho tiempo…

source: creature of dawn tresion
es_419: Bestia del amanecer Tresion

source: yes, sir!
es_419: ¡Sí, señor!

source: y{j}yikes lmao{j}ss
es_419: Cielos, qué risa.

source: you look happy, sir!
es_419: ¡Se ve muy contento, señor!

source: this game sucks lmao.
es_419: ¡Este juego apesta! LOL

source: oh, gosh. that’s so mean.
es_419: Vaya, eso me dolió.

source: kyaaaa!
es_419: ¡Aaaah!

source: flap
es_419: FLOP

source: ...forest.
es_419: … bosque.

source: don’t let him even catch his breath!
es_419: ¡No dejen que se recupere!

source: human child.
es_419: Niño humano…

source: scooping up the field mice.
es_419: ¡Y a los ratoncitos…

source: most importantly, this weapon has infinite durability.
es_419: Pero lo más importante es que la durabilidad de esta arma es infinita.

source: next episode
es_419: Próximo episodio:

source: n-noob?!
es_419: ¡¿N-novato?!

source: ...the very first master level user was born.
es_419: … el primer usuario en llegar al nivel maestro.

source: how about you just hand them over before I beat the crap out of you?
es_419: ¿Qué tal si me las das antes de que te dé una paliza?

source: what do you mean? that’s clearly you.
es_419: ¿Qué dice? Claramente es usted.

source: +6 wooden stick extra damage +64
es_419: Palo de madera +6 Daño extra +64

source: ju{j}run!
es_419: ¡Corre!

source: you have successfully logged out of chrono life.
es_419: Te has desconectado con éxito de Chrono Life.

source: ack!
es_419: ¡Ajj!

source: ever since she was young, sarang showed a talent for singing.
es_419: Desde que era pequeña, Sarang demostró tener talento para cantar.

source: or fairy tales in my free time.
es_419: o cuentos de hadas,en mi tiempo libre.

source: get down here right now!
es_419: ¡Baja aquí ahora mismo!

source: wait! you’re not part of a guild?!
es_419: ¡Espera! ¡¿No formas parte de ningún gremio?!

source: stop following me!
es_419: ¡Dejen de seguirme!

source: right! yes, yes!
es_419: ¡Claro! ¡Sí, sí!

source: you’re willing to go that far for your own selfish satisfaction?
es_419: ¿Estás dispuesto a llegar a tanto por un capricho?

source: whoa!
es_419: ¡Guau!

source: ...I learned one thing.
es_419: … aprendí una cosa.

source: hurrah!
es_419: ¡Hurra!

source: she had been traumatized.
es_419: Había quedado traumatizada.

source: first, I met that weird guy who called himself a god.
es_419: Primero, me encontré con ese tipo raro que decía que era un dios.

source: you said you’d be right back! it’s already dark, you prick!
es_419: ¡Dijiste que volverías enseguida! ¡Ya es de noche, imbécil!

source: ...how is this brat taking all of us down?!
es_419: … ¡¿cómo es que este mocoso nos gana a todos?!

source: hey, did you hear the news?
es_419: Oye, ¿te enteraste?

source: you guys are all such little sheep. what’s wrong with all of you?!
es_419: Son todos ovejas. ¡¿Qué pasa con ustedes?!

source: this pro player will take you down easy!
es_419: ¡Esta jugadora pro acabará con ustedes!

source: oh, uhh...
es_419: Ah, eh…

source: also...
es_419: Y también…

source: this little noob must have a death wish.
es_419: Este novato debe querer morir.

source: qk{j}yeah.
es_419: Sí.

source: the word "sorry" doesn't mean much to you, does it?
es_419: “Lo siento” no significa mucho para ti, ¿no?

source: I believe the drama is titled "potty-mouth teen".
es_419: Creo que la serie se llama “La adolescente malhablada”.

source: my poor ramborghini that cost me 400 million won!
es_419: ¡Mi pobre Ramborghini, que me costó 400 millones de wones!

source: one of the other four guardians will be taking over your mission.
es_419: Uno de los otros cuatro guardianes terminará tu misión.

source: she’s a superstar solo idol!
es_419: ¡Es una solista superestrella!

source: of course, I’ve seen the announcement posted by the game developer.
es_419: Claro, vi el anuncio que publicaron los desarrolladores del juego.

source: from the get-go, I just wanted to lure you here to kill you.
es_419: Desde un principio, quería traerte hasta aquí para matarte.

source: hahahahahaha!
es_419: ¡Ja, ja, ja, ja, ja, ja, ja!

source: you have used all of your available ability points.
es_419: Has usado todos sus puntos de habilidad.

source: w-wait...
es_419: E-espera…

source: soul of the sword activated
es_419: Alma de la espada Activado

source: g{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}h{j}!
es_419: ¡Aaaaaaaaaaaaaaaaaaaaah!

source: ...that luv and I had met in person.
es_419: … que Amor y yo nos veíamos en persona.

source: I was watching earlier.
es_419: Yo estaba observando.

source: ooh, already?
es_419: Ah, ¿tan pronto?

source: that’s because urus and I ar--
es_419: Eso es porque Urus y yo som…

source: for 14 weeks straight!
es_419: ¡Ya 14 semanas consecutivas!

source: ...the prologue to my story.
es_419: … el prólogo de mi historia.

source: dude, I almost hit you!
es_419: ¡Viejo, casi te ataco!

source: basically, you can’t equip anything now!
es_419: Básicamente, ¡ahora no puede usar nada!

source: they always have a weak-looking main character who’s actually super strong.
es_419: Siempre hay un protagonista que se ve débil, pero que, en realidad, es superfuerte.

source: groan
es_419: GRRRR

source: f*cking noob.
es_419: Novato de m*erda.

source: all right, then!
es_419: ¡Muy bien!

source: hidden skill healing factor
es_419: Habilidad secreta Factor curativo

source: justice will be served.
es_419: se hará justicia.

source: wrap
es_419: ACOMODA

source: ...of this world.
es_419: … de este mundo.

source: the soul of the [shield] has entered your body.
es_419: El alma de [el escudo] ha entrado en tu cuerpo.

source: I’m k-keeping up my secretly op persona.
es_419: Debo mantener mi imagen SP secreta.

source: creature of the abyss lapis
es_419: Bestia del abismo Lapis

source: we know you can do better than this.
es_419: Sabemos que puedes dar más.

source: it's the guild leader of the "sacred guild"...
es_419: Es la líder del Gremio Sagrado...

source: h{j}y{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}
es_419: KIAAAAAAAAAAAAAAAAAAA

source: why did he act like he was weak in front of me?
es_419: ¿Por qué fingió ser débil conmigo?

source: you’ve got a lot to learn, urus.
es_419: Tienes mucho que aprender, Urus.

source: it wasn’t just me who had evolved with the changing times.
es_419: No era solo yo quien había evolucionado con los años.

source: but then again...
es_419: Pero, igual…

source: sarang han (17) idol and singer-songwriter
es_419: SARANG HAN (17) ESTRELLA Y COMPOSITORA

source: master-servant contract request from twin-headed dragon, urus
es_419: Petición de contrato de amo-sirviente de parte de Urus, el dragón de dos cabezas

source: she now has a severe traumatic response...
es_419: Le quedó una reacción traumática severa…

source: either way...
es_419: Sea como sea…

source: why, you! undies! get over here!
es_419: ¡¿Qué te dije, Calzón?! ¡Ven aquí!

source: it’s a function provided to the userbase for players and livestreamers.
es_419: Es una función para jugadores y creadores de contenido en vivo.

source: pi{j}hey, everyone! my character’s back!
es_419: ¡Oigan todos! ¡Mi personaje volvió!

source: hallasan guild manager mr. jeong
es_419: Administrador del Gremio de Hallasan Sr. Jeong

source: ...you’re just a human.
es_419: … eres solo un humano.

source: or...
es_419: O…

source: the grave of mortals ravine of the deceased
es_419: La tumba de los mortales El Valle de los Muertos

source: ...were all for nothing in this wild goose chase for that "special something" that doesn't even exist.
es_419: … han sido en vano en esta búsqueda inútil de ese "algo especial" que ni siquiera existe.

source: you already made it all the way here?
es_419: ¿Ya llegaste hasta aquí?

source: h-have you ever heard of the "ego sword"?
es_419: ¿Alguna vez oyó hablar de la “Espada Ego”?

source: listen here, ascended one.
es_419: Escúchame, ascendido.

source: starting now, loser!
es_419: ¡Desde ahora, perdedor!

source: there is one person you could go for.
es_419: Tengo a alguien en mente.

source: ...if you’d like to party up with me and go farm.
es_419: … si te gustaría hacer un grupo conmigo e ir a buscar objetos.

source: but that was...
es_419: Pero ese fue…

source: ky{j}he went off.
es_419: Enloqueció.

source: I can see that.
es_419: Ya lo veo.

source: you need to get up!
es_419: ¡Tiene que levantarse!

source: 1 sec
es_419: 1 seg

source: and after a tumultuous time of being unrecognized for her talents...
es_419: Y después de pasar una época turbulenta en la que no era reconocida por su talento…

source: ...evolving it into the "ego sword".
es_419: … y evolucionaría hasta transformarse en la “Espada Ego”.

source: *about 80,000 usd (exchange rate of jun 2022)
es_419: *Unos 80 000 USD (al cambio de junio de 2022)

source: but today, I’m gonna wring this place dry.
es_419: Pero hoy voy a dejar seco este lugar.

source: [strike without killing].
es_419: [Golpear sin matar].

source: he and I...
es_419: Él y yo…

source: fighter luv{j}
es_419: Luchadora AMOR

source: chrono life’s ultimate boss monster
es_419: ENEMIGO FINAL DE CHRONO LIFE

source: it wasn’t nice of you to lie.
es_419: No estuvo bien que le mintiera.

source: but you’re after the wrong person here.
es_419: Pero estás atacando a la persona equivocada.

source: why...
es_419: ¿Por qué…?

source: I’ve only got three hits left, right?
es_419: Solo me quedan tres golpes, ¿no?

source: ...is that so?
es_419: Ah, ¿no?

source: ...tragedy awaited her in the near future.
es_419: … pronto llegaría la tragedia.

source: what’s wrong, sarang?
es_419: ¿Qué pasa, Sarang?

source: how is he even one of the four guardians?
es_419: ¿Cómo es que es uno de los cuatro guardianes?

source: if it wasn’t for the money, I probably would’ve strangled you to death by now.
es_419: Si no fuera por el dinero, ya te habría estrangulado.

source: no, it definitely wasn’t because of anything like that.
es_419: No, definitivamente no fue por nada de eso.

source: why do I feel like we’re forgetting something?
es_419: ¿Por qué siento que nos olvidamos de algo?

source: so urakan is already out, huh?
es_419: Así que Urakan ya salió, ¿eh?

source: urakan lv.{j}723
es_419: Urakan Nv. 723

source: you have been severely injured.
es_419: Has sido gravemente herido.

source: rah!
es_419: ¡Gag!

source: hey, it’s 10 minutes before we start! stop playing that game of yours and hurry up! what’s wrong with you?!
es_419: ¡Oye, faltan 10 minutos para empezar! ¡Deja de jugar a ese juego y date prisa! ¡¿Qué te pasa?!

source: dude wtf is that?{j}pa
es_419: ¿Qué caraj* es eso?

source: hidden class master novice
es_419: Clase oculta Maestro novato

source: I was hoping to become a swordsman, though.
es_419: Aunque esperaba convertirme en espadachín.

source: we even hold our own against the top five guilds!
es_419: ¡Podemos hacerle frente a los cinco mejores gremios!

source: also,
es_419: Además,

source: blade of the ascended
es_419: Cuchilla de los Ascendidos.

source: it's just a little ironic that you of all people want to complain about "balance" here.
es_419: Es un poco irónico que justamente usted se queje del “equilibrio” que hay aquí.

source: ...is gone?!
es_419: … ¡¿ya no existe?!

source: y-yes, sir...
es_419: S-sí, señor…

source: are you kidding me?!
es_419: ¡No puede ser cierto!

source: it must have been the theatrics of it all. because instead of getting angry...
es_419: Debe haber sido por la teatralidad de la escena que, en lugar de enojarme…

source: episode 20. one love (4)
es_419: Episodio 20: Un amor (4)

source: episode 4. this game actually has an ending?
es_419: Episodio 4: ¿Este juego realmente tiene final?

source: sarang han sarang han chrono life chrono life sarang han game sarang han game id chrono life id virtual reality game
es_419: Sarang Han Sarang Han Chrono Life Chrono Life Sarang Han juego Sarang Han juego identidad Chrono Life identidad

source: foolish mortal...
es_419: ¡Mortal estúpido!

source: you know what?
es_419: ¿Sabes qué?

source: isn’t the world just so cruel?
es_419: ¿No crees que el mundo es muy cruel?

source: archaic art: disintegration!
es_419: Artes arcanas: ¡desintegración!

source: that can’t be.
es_419: Es imposible.

source: if only it weren’t for this weapon durability system...
es_419: Si no fuera por la durabilidad de esta arma…

source: episode 1. +99 Reinforced Wooden Stick
es_419: Episodio 1. Palo de madera +99

source: y-you need to hurry and see this.
es_419: D-debe venir rápido a ver esto.

source: when healing factor popped off...
es_419: Cuando el factor de curación se activó…

source: d-don’t yell at her like that.
es_419: N-no le grites así.

source: the three bosses of urus’ legion will no longer respawn.
es_419: Los tres jefes de la legión de Urus no volverán a reaparecer.

source: that’s silly if you ask me.
es_419: Eso es una estupidez, en mi opinión.

source: now that I’m moved in, I definitely have to do this.
es_419: Ahora que me mudé, tengo que hacer esto.

source: with his unique charm and charisma, he’s successfully launched a streaming career, utube career, made appearances on public television, and more.
es_419: Con su carisma y encanto incomparables, desarrolló una carrera exitosa como streamer en Utube, hizo apariciones en la televisión pública y mucho más.

source: durability
es_419: Durabilidad

source: that was the reality of the games today.
es_419: Esa era la realidad de los juegos hoy en día.

source: poetry?
es_419: ¿Poesía?

source: that man!
es_419: ¡Ese hombre!

source: is he giving this to me?
es_419: ¿Me está dando esto?

source: did I not introduce myself?
es_419: ¿No me presenté?

source: what a sad end for you old linnagers.
es_419: Qué triste final para los viejos Linnagers.

source: so in the end...
es_419: Así que al final…

source: throughout all of today...
es_419: En todo el día…

source: ta-da!
es_419: ¡Tarán!

source: I’m the type who needs to pay back the same pain my opponent gave me.
es_419: Soy de los que necesitan impartir a sus enemigos el mismo dolor que le causaron.

source: go, undies!
es_419: ¡Ve, Calzón!

source: goodness.
es_419: Cielos.

source: what was that?{j}k
es_419: ¿Qué fue eso?

source: it did touch.
es_419: Sí lo tocó.

source: you really don’t care anymore, huh?
es_419: Ya no te importa más nada, ¿no?

source: I’ll just take them down a hundred times today.
es_419: Hoy solo los mataré cien veces.

source: your weapon is badly damaged. it will break soon.
es_419: Tu arma está muy dañada. Se romperá pronto.

source: practice?
es_419: ¿Practicar?

source: of getting rid of the indent from my glasses.
es_419: cómo quitarme la marca de la nariz.

source: up next is tonight’s last music banking performance!
es_419: A continuación, ¡la última presentación de esta noche!

source: ...I order this vicious murderer to be arrested and confined for murdering over 800,000 players!
es_419: … ¡ordeno que arresten y encierren a este asesino despiadado por la masacre de 800 000 jugadores!

source: it’s not enough.
es_419: No es suficiente.

source: v{j}r{j}o{j}o{j}m
es_419: BRUUM

source: r-royal mages!
es_419: ¡M-magos reales!

source: this is also him.
es_419: Este también es él.

source: I didn’t cut the power or anything like that.
es_419: No corté la electricidad ni nada parecido.

source: wtf?{j}q
es_419: ¿Qué caraj*?

source: greed only breeds misfortune.
es_419: La codicia solo engendra desgracias.

source: wh-who the hell are you?!
es_419: ¡¿Q-quién rayos eres tú?!

source: you better watch where you’re going, man.
es_419: Mejor fíjate por dónde vas, chico.

source: mom...?
es_419: ¿Mamá…?

source: I knew it felt like something was missing.
es_419: Sabía que faltaba algo.

source: after a thorough investigation, we have found that this user’s character was not a bug or the result of a hack.
es_419: Luego de una investigación rigurosa, comprobamos que el personaje de este usuario no tenía ninguna falla y que no usó un truco.

source: ...old man.
es_419: … viejo.

source: you will now be forced back to your original location.
es_419: Ahora regresarás a tu última ubicación.

source: it’s you, isn’t it?
es_419: Eres tú, ¿no?

source: don’t worry about it.
es_419: No te preocupes.

source: wh-what’s with her?
es_419: ¿Q-qué le pasa?

source: ...after you deal with the enemy in front of you first?
es_419: … una vez que hayas vencido al enemigo que tienes delante?

source: exploration.
es_419: Exploración.

source: am I wrong?!
es_419: ¡¿Me equivoco?!

source: is that him?!
es_419: ¡¿Será él?!

source: but no one has ever made it that far.
es_419: Pero nadie ha llegado hasta ese punto.

source: my apologies, "brave warrior".
es_419: Mis disculpas, “valiente guerrero”.

source: crap.
es_419: Diablos.

source: but now there are tons of baseless rumors about you floating around online!
es_419: ¡sino que ahora hay miles de rumores infundados sobre ti circulando en la red!

source: all of the players there became urakan’s fodder.
es_419: Todos los jugadores se convirtieron en alimento para Urakan.

source: it’s as if...
es_419: Es como si…

source: pretty good.
es_419: Bastante bien.

source: I should just quit.
es_419: Debería rendirme y ya.

source: you were the one...
es_419: Tú fuiste…

source: ...just ignore them.
es_419: Ignóralos.

source: I can guarantee I’m way out of your league.
es_419: Te garantizo que soy demasiado para ti.

source: what kind of ridiculous update is this?!
es_419: ¡¿Qué clase de actualización ridícula es esta?!

source: but I still feel like I need more.
es_419: Pero aún siento que necesito más.

source: +2 wooden stick extra damage +2
es_419: Palo de madera +2 Daño extra +2

source: just go and apologize.
es_419: Vaya y discúlpese.

source: who are you?
es_419: ¿Quién eres?

source: I couldn’t even dream of such power!
es_419: ¡Ni yo podría soñar con un poder tan descomunal!

source: these skills that habaek is using...
es_419: Las habilidades que está usando habaek...

source: all of the energy he stole left his body.
es_419: Toda la energía que robó salió de su cuerpo.

source: this is the land where life and death converge.
es_419: Esta es la tierra en donde la vida y la muerte convergen.

source: how dare you attack your own mother like that?!
es_419: ¡¿Cómo te atreves a atacar a tu propia madre?!

source: has been cracked in half!!!
es_419: ¡¡¡quedó partido en dos!!!

source: you are worthy of admiration.
es_419: Eres digno de admiración.

source: ...about the most important thing!
es_419: … ¡de lo más importante de todo!

source: I said I’m going to swing with all of my power.
es_419: Dije que voy a golpear con toda mi fuerza.

source: pa{j}no way.
es_419: Imposible.

source: it’s time to flex on these losers!
es_419: ¡Es hora de alardear con estos perdedores!

source: first in most users online at the same time.
es_419: Primero en cantidad de usuarios en línea al mismo tiempo.

source: but where’s your other head?
es_419: Pero ¿dónde está tu otra cabeza?

source: why can’t you see our true intentions?
es_419: ¿Por qué no ves nuestra verdadera motivación?

source: I’m sorry!
es_419: ¡Lo siento!

source: who are they?
es_419: ¿Quiénes son?

source: let’s finish things up here.
es_419: Terminemos de una vez.

source: and the rest of her equipment is top of the line.
es_419: Y el resto de su equipamiento es de primera calidad.

source: I made sure to keep you alive.
es_419: Me aseguré de dejarte con vida.

source: eight mirrors.
es_419: Ocho espejos.

source: you have a restraining order...
es_419: Hay una orden de restricción…

source: and finally...
es_419: Y por último…

source: you destroyed all forms of life on that pla--
es_419: Destruiste toda forma de vida en ese pla…

source: ...my mom’s favorite place.
es_419: … era el lugar favorito de mi mamá.

source: did we just make eye contact?
es_419: ¿Hicimos contacto visual?

source: ...I’d be about a bronze 4.
es_419: … sería más o menos un bronce 4.

source: he’s too caught up in this schtick.
es_419: Está demasiado metido en esta farsa.

source: why would they suddenly do that?
es_419: ¿Por qué harían eso?

source: striking monsters while not killing them? pfft.
es_419: ¿Golpear a monstruos sin matarlos? Pfff.

source: boom!
es_419: ¡BUUM!

source: ch{j}come and watch, everyone!
es_419: ¡Vengan todos a ver!

source: I should make up a name for my skills too.
es_419: Debería inventar uno así para mis habilidades.

source: and then...
es_419: Y luego…

source: but that old man refuses to give up, and came to get his revenge.
es_419: Pero ese viejo de ahí no se rinde y vino por venganza.

source: brrrr
es_419: BRRR

source: your attack has slain another player.
es_419: Acabas de matar a otro jugador.

source: hallasan guild manager mr. choi
es_419: Administrador del Gremio de Hallasan Sr. Choi

source: I never thought I would see the day where I punished an ascended one with my own two hands.
es_419: Jamás creí que llegaría el día en que tendría que castigar a un ascendido con mis propias manos.

source: if I can’t directly kill you...
es_419: Si no te puedo matar directamente…

source: company?
es_419: ¿Empresa?

source: but on "doomsday", none of the members of the world guild alliance turned it so they could make a preemptive attack.
es_419: Pero en el “juicio final”, ningún miembro de la alianza mundial de gremios la usó para poder lanzar un ataque sorpresa.

source: not just the newbies starting out...
es_419: Allí no solo hay novatos que recién empiezan…

source: it feels really important too...
es_419: Y creo que es algo importante…

source: I think she’s mad at you.
es_419: Creo que está enojada con usted.

source: godly fighter
es_419: Guerrero divino

source: maybe I should’ve asked why first.
es_419: Quizá debería haberle preguntado los motivos primero.

source: now you’re getting slower.
es_419: Pero ahora te volviste más lento.

source: not only are the phones ringing off the hook with the press trying to get a comment,
es_419: No solo la prensa no para de llamar para obtener una declaración,

source: hisssss!
es_419: ¡SHAAAA!
